// 배열 실습 1 : 배열 고차함수 사용금지

// 1
// 배열에서 귤이 존재하면 '귤이 있습니다' 존재하지 않으면 '귤이 없습니다' 출력
let fruits = ["사과", "배", "귤", "감"];
let input = "귤";

// 2
// 배열에서 '노랑'을 제거한 배열을 출력
let colors = ["빨강", "파랑", "노랑", "초록"];
let target = "노랑";

// 3
// reverse메서드를 사용하지 말고 배열 뒤집어 출력
let nums = [1, 2, 3, 4, 5];
let reversed = [];

// 4
// 배열에서 최대값 구해서 출력
let arr1 = [7, 3, 9, 12, 5];
let max = arr1[0];

// 5
// 배열의 인덱스 2에 'C'를 삽입하고 배열을 출력
let alphabet = ["A", "B", "D", "E"];

// 6
// 중복된 요소가 제거된 배열을 출력
let origin = [1, 3, 3, 5, 1, 7, 9, 9];
let unique = [];

// 7
// 3행 3열 배열을 만들고 1부터 9까지 채워서 출력
let matrix = [];
let count = 1;

// 8
// 배열에서 인덱스 1과 인덱스 3의 요소를 바꾼 배열을 출력
let arr2 = ["가", "나", "다", "라", "마"];

// 9
// 배열에서 짝수만 모은 배열을 출력
let numbers = [10, 13, 22, 37, 40, 55];
let even = [];

// 10
// 배열을 오른쪽으로 한칸씩 회전하기
// ex) [1,2,3,4] => [4,1,2,3]
let arr3 = [1, 2, 3, 4];






























